EDT/КассовыйСервер/src/InformationRegisters/ксСтатусыСостоянияККМ/ксСтатусыСостоянияККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксСтатусыСостоянияККМ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеККМОчередьПечатиЧеков</name>
    <type>
      <types>EnumRef.ксСостоянияККМОчередиПечатиЧеков</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкиПечатиККМ</name>
    <comment>КоличествоОшибок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусУстановленWEBСервисом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/InformationRegisters/ксСостояниеСменККМ/ксСостояниеСменККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксСостояниеСменККМ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеСмены</name>
    <type>
      <types>EnumRef.ксСостояниеСменККМ</types>
    </type>
  </resources>
  <dimensions>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ксКассиры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/InformationRegisters/ксЛогАвтоматическогоЗакрытияСменыНаККМ/ксЛогАвтоматическогоЗакрытияСменыНаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксЛогАвтоматическогоЗакрытияСменыНаККМ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/InformationRegisters/ксВременнойИнтервалВозможногоСозданияЧековВМП/ксВременнойИнтервалВозможногоСозданияЧековВМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксВременнойИнтервалВозможногоСозданияЧековВМП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИнтервалВремени</name>
    <type>
      <types>CatalogRef.ксИнтервалыВремени</types>
    </type>
  </resources>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/InformationRegisters/ксПолучатели/ксПолучатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксПолучатели</name>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ксТипыСобытийУведомления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/Enums/ксСостоянияККМОчередиПечатиЧеков/ксСостоянияККМОчередиПечатиЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксСостоянияККМОчередиПечатиЧеков</name>
  <enumValues>
    <name>ККМСвободна</name>
  </enumValues>
  <enumValues>
    <name>ККМЗанята</name>
  </enumValues>
  <enumValues>
    <name>ККМВыключена</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПечати</name>
  </enumValues>
  <enumValues>
    <name>ККМЗахваченаКассиром</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Enums/ксСостояниеСменККМ/ксСостояниеСменККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксСостояниеСменККМ</name>
  <enumValues>
    <name>СменаОткрыта</name>
  </enumValues>
  <enumValues>
    <name>СменаЗакрыта</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Enums/ксТипыКассовыхЧеков/ксТипыКассовыхЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксТипыКассовыхЧеков</name>
  <enumValues>
    <name>ЧекПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекВозвратаПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекВозвратаРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииВозвратаПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррецииРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииВозвратаРасхода</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Documents/ксОткрытиеСменыККМ/ксОткрытиеСменыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ксОткрытиеСменыККМ</name>
  <registerRecords>InformationRegister.ксСостояниеСменККМ</registerRecords>
  <attributes>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ксКассиры</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОткрытаЧерезWEBСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/КассовыйСервер/src/Documents/ксЗакрытиеСменыККМ/ксЗакрытиеСменыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ксЗакрытиеСменыККМ</name>
  <registerRecords>InformationRegister.ксСостояниеСменККМ</registerRecords>
  <attributes>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаЗакрытаЧерезWEBСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/КассовыйСервер/src/CommonModules/ксРаботаСККМСервер/Module.bsl
Процедура РегламентЗакрытиеКассовыхСмен() Экспорт
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ксСтатусыСостоянияККМСрезПоследних.ККМ КАК ККМ
	            |ПОМЕСТИТЬ ВТ_РаботающиеККМ
	            |ИЗ
	            |	РегистрСведений.ксСтатусыСостоянияККМ.СрезПоследних(&ТекДата, ) КАК ксСтатусыСостоянияККМСрезПоследних
	            |ГДЕ
	            |	ксСтатусыСостоянияККМСрезПоследних.СостояниеККМОчередьПечатиЧеков = ЗНАЧЕНИЕ(Перечисление.ксСостоянияККМОчередиПечатиЧеков.ККМСвободна)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТ_РаботающиеККМ.ККМ КАК ККМ,
	            |	ксСостояниеСменККМСрезПоследних.Кассир.Наименование КАК Кассир
	            |ИЗ
	            |	ВТ_РаботающиеККМ КАК ВТ_РаботающиеККМ
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ксСостояниеСменККМ.СрезПоследних(&ТекДата, ) КАК ксСостояниеСменККМСрезПоследних
	            |		ПО ВТ_РаботающиеККМ.ККМ.Ссылка = ксСостояниеСменККМСрезПоследних.ККМ.Ссылка
	            |ГДЕ
	            |	ксСостояниеСменККМСрезПоследних.СостояниеСмены = ЗНАЧЕНИЕ(Перечисление.ксСостояниеСменККМ.СменаОткрыта)";
	Зап.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Рез = Зап.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат;
	КонецеСли;
	
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Попытка
			Кассир = "Кассир 1";
			Если ЗначениеЗаполнено(Выб.Кассир) Тогда
				Кассир = Выб.Кассир;
			КонецЕсли;	
			Ответ = СнятьZОтчетККМ(Выб.ККМ, Кассир);
			Если Ответ.Успешно Тогда
				ЗарегистрироватьЗакрытиеСменыККМ(Выб.ККМ);
				ДобавитьЗаписьВЛогАвтоматическогоЗакрытияСмен(Выб.ККМ, Истина, "");
			Иначе
				ДобавитьЗаписьВЛогАвтоматическогоЗакрытияСмен(Выб.ККМ, Ложь, Ответ.ОписаниеОшибки);
			КонецеСли;	
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ДобавитьЗаписьВЛогАвтоматическогоЗакрытияСмен(Выб.ККМ, Ложь, ТекстОшибки);
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры	

Функция ЗарегистрироватьОткрытиеСменыККМ(ККМ, Кассир = "", СменаОткрытаЧерезWEBСервис = Ложь) Экспорт
	Док = Документы.ксОткрытиеСменыККМ.СоздатьДокумент();
	Док.ККМ = ККМ;
	Док.Дата = ТекущаяДата();
	Док.Кассир = Кассир;
	Док.СменаОткрытаЧерезWEBСервис = СменаОткрытаЧерезWEBСервис;
	
	Док.Записать(РежимЗаписиДокумента.Запись);
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Возврат Док.Ссылка;
КонецФункции

Функция СнятьZОтчетККМ(ККМ, Кассир) Экспорт
	Струк = Новый Структура;
	
	СерверККТ = ККМ_ФЗ_54.ПодключитьсяКККМ(ККМ);
	Если СерверККТ = Ложь Тогда
		Струк.Вставить("Успешно", Ложь);
		Струк.Вставить("ОписаниеОшибки", "Не могу подключиться к ККМ");
		Возврат Струк;
	КонецеСли;
	
	Рез = ККМ_ФЗ_54.СнятьZОтчет(СерверККТ, Кассир);
	Если Рез = Ложь Тогда
		Струк.Вставить("Успешно", Ложь);
		Струк.Вставить("ОписаниеОшибки", "Не могу снять Z отчет ККМ");
		Возврат Струк;
	КонецеСли;
	
	
	
	Струк.Вставить("Успешно", Истина);
	Струк.Вставить("ОписаниеОшибки", "");
	Возврат Струк;
КонецФункции

Функция ЗарегистрироватьЗакрытиеСменыККМ(ККМ, СменаЗакрытаЧерезWEBСервис = Ложь) Экспорт
	Док = Документы.ксЗакрытиеСменыККМ.СоздатьДокумент();
	Док.ККМ = ККМ;
	Док.Дата = ТекущаяДата();
	Док.СменаЗакрытаЧерезWEBСервис = СменаЗакрытаЧерезWEBСервис;
	
	Док.Записать(РежимЗаписиДокумента.Запись);
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Возврат Док.Ссылка;
	
КонецФункции	

Процедура ДобавитьЗаписьВЛогАвтоматическогоЗакрытияСмен(ККМ, Успешно, ТекстОшибки) 
	ТД = ТекущаяДата();
	Наб = РегистрыСведений.ксЛогАвтоматическогоЗакрытияСменыНаККМ.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТД);
	
	Нов = Наб.Добавить();
	Нов.Период = ТД;
	Нов.ККМ = ККМ;
	Нов.Успешно = Успешно;
	Нов.ОписаниеОшибки = ТекстОшибки;
	
	Наб.Записать();
КонецПроцедуры	

Функция ПолучитьИдентификаторТипаКассовогоЧекаДляККМ(ТипЧека) Экспорт
	Если (ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекПрихода) Или Не ЗначениеЗаполнено(ТипЧека) Тогда
		Возврат 1;
	ИначеЕсли ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекВозвратаПрихода Тогда	
		Возврат 2;
	ИначеЕсли ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекРасхода Тогда	
		Возврат 4;
	ИначеЕсли ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекВозвратаРасхода Тогда	
		Возврат 5;
	ИначеЕсли ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекКоррекцииПрихода Тогда	
		Возврат 7;
	ИначеЕсли ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекКоррекцииВозвратаПрихода Тогда	
		Возврат 8;
	ИначеЕсли ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекКоррецииРасхода Тогда	
		Возврат 9;
	ИначеЕсли ТипЧека = Перечисления.ксТипыКассовыхЧеков.ЧекКоррекцииВозвратаРасхода Тогда	
		Возврат 10;
	КонецеСли;	
КонецФункции	

Функция ПолучитьТипКассовогоЧекаДляККМПоИдентификатору(ИдентификаторТипаЧека) Экспорт
	Если ИдентификаторТипаЧека = 1 Тогда
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекПрихода;
	ИначеЕсли ИдентификаторТипаЧека = 2 Тогда	
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекВозвратаПрихода;
	ИначеЕсли ИдентификаторТипаЧека = 4 Тогда	
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекРасхода;
	ИначеЕсли ИдентификаторТипаЧека = 5 Тогда	
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекВозвратаРасхода;
	ИначеЕсли ИдентификаторТипаЧека = 7 Тогда	
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекКоррекцииПрихода;
	ИначеЕсли ИдентификаторТипаЧека = 8 Тогда	
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекКоррекцииВозвратаПрихода;
	ИначеЕсли ИдентификаторТипаЧека = 9 Тогда	
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекКоррецииРасхода;
	ИначеЕсли ИдентификаторТипаЧека = 10 Тогда	
		Возврат Перечисления.ксТипыКассовыхЧеков.ЧекКоррекцииВозвратаРасхода;
	КонецеСли;	
КонецФункции	

Функция ПолучитьТекущегоКассира(ККМ) Экспорт
	ЗапросПоследняяЗапись = Новый Запрос("ВЫБРАТЬ
	|	СостояниеСменККМСрезПоследних.СостояниеСмены КАК СостояниеСмены,
	|	СостояниеСменККМСрезПоследних.Кассир КАК Кассир,
	|	СостояниеСменККМСрезПоследних.Период КАК Период,
	|	СостояниеСменККМСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ксСостояниеСменККМ.СрезПоследних КАК СостояниеСменККМСрезПоследних
	|ГДЕ
	|	СостояниеСменККМСрезПоследних.ККМ = &ККМ");
	ЗапросПоследняяЗапись.УстановитьПараметр("ККМ", ККМ);
	РезПоследняяЗапись = ЗапросПоследняяЗапись.Выполнить().Выбрать();
	
	Если РезПоследняяЗапись.Следующий() Тогда	
		Если РезПоследняяЗапись.СостояниеСмены = Перечисления.ксСостояниеСменККМ.СменаОткрыта Тогда
			Возврат РезПоследняяЗапись.Кассир;
		Иначе
			Возврат ПолучитьТекущегоКассираУТЛ(ККМ);
		КонецеСли;	
	Иначе
		Возврат ПолучитьТекущегоКассираУТЛ(ККМ);
	КонецеСли;	
КонецФункции	

Функция ПолучитьТекущегоКассираУТЛ(ККМ) Экспорт
    Прокси = WSСсылки.КассовыйСерверУТЛ.СоздатьWSПрокси("http://www.strizh-logistic.org/cashe_server", "casheServer", "casheServerSoap",,10);
	Прокси.Пользователь = "Admin";
	Прокси.Пароль = "123";
	
	Попытка
		Рез = Прокси.getCashier(ККМ.УникальныйИдентификатор());
	Исключение
		Возврат Справочники.ксКассиры.Кассир1;
	КонецПопытки;	
	
	Если ЗначениеЗаполнено(Рез) Тогда
		UIDD = Новый УникальныйИдентификатор(Рез);
		Кассир = Справочники.ксКассиры.ПолучитьСсылку(UIDD);
		
		Если Не ЗначениеЗаполнено(Кассир.Код) Тогда
			Возврат Справочники.ксКассиры.Кассир1;
		КонецеСли;
		
		Возврат Кассир.Ссылка;
	Иначе
		Возврат Справочники.ксКассиры.Кассир1;
	КонецеСли;	
КонецФункции	

Функция ОтправкаСистемногоСообщенияEMAIL(МассивПолучателей, ТекстСообщения, ТемаСообщения) Экспорт
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись, Ложь);
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;		
	Сообщение.Отправитель = УчетнаяЗапись.Пользователь;
	
	Сообщение.Тема = ТемаСообщения;
	
	Для Каждого Тек Из МассивПолучателей Цикл
		Сообщение.Получатели.Добавить(СокрЛП(Тек));
	КонецЦикла;	
	
	Сообщение.Тексты.Добавить(ТекстСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);
	
	Почта = Новый ИнтернетПочта;
	Успешно = Ложь;
	Попытка 
		Сообщить("Отправка почтового сообщения...");
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		Сообщить("Сообщения успешно отправлены!");
		Успешно = Истина;
	Исключение
		Сообщить("Ошибка соединения с сервером.",СтатусСообщения.ОченьВажное);
		Сообщить(""+ОписаниеОшибки());
		Успешно = Ложь;
	КонецПопытки;
КонецФункции	

Функция ВозможноСоздатьЧекВТекущийМоментВремени(ДатаВремяМомента = Неопределено) Экспорт
	
	Если ДатаВремяМомента = Неопределено Тогда
		ВремяИнтервала = ТекущаяДата();
	Иначе
		ВремяИнтервала = ДатаВремяМомента;
	КонецеСли;	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ВЫБОР
	            |		КОГДА ксИнтервалыВремениИнтервалы.ВремяС <= &ПараметрВремя
	            |				И ксИнтервалыВремениИнтервалы.ВремяПо >= &ПараметрВремя
	            |			ТОГДА ИСТИНА
	            |		ИНАЧЕ ЛОЖЬ
	            |	КОНЕЦ КАК МожноСоздатьЧек
	            |ИЗ
	            |	РегистрСведений.ксВременнойИнтервалВозможногоСозданияЧековВМП.СрезПоследних КАК ксВременнойИнтервалВозможногоСозданияЧековВМПСрезПоследних
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ксИнтервалыВремени.Интервалы КАК ксИнтервалыВремениИнтервалы
	            |		ПО ксВременнойИнтервалВозможногоСозданияЧековВМПСрезПоследних.ИнтервалВремени.Ссылка = ксИнтервалыВремениИнтервалы.Ссылка.Ссылка";
	Зап.УстановитьПараметр("ПараметрВремя", Дата('00010101') + (ВремяИнтервала-НачалоДня(ВремяИнтервала)));			
	
	Рез = зап.Выполнить();
	
	Если Рез.Пустой() тогда
		Возврат Истина;
	Иначе	
		Выб = Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			Если Выб.МожноСоздатьЧек Тогда
				Возврат Истина;
			КонецеСли;	
		КонецЦикла;	
		Возврат Ложь;
	КонецеСли;	
КонецФункции	

Функция Ping(IPАдрес) Экспорт
	
	objShell = Новый COMОбъект("WScript.Shell") ;
    objScriptExec = objShell.Exec("ping.exe -n 1 " + IPАдрес) ;
    strPingResults = НРег(objScriptExec.StdOut.ReadAll());
	
	Возврат   Найти(strPingResults, "ttl=");
	
КонецФункции

Функция ВернутьМассивАдресов(Событие) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ксПолучатели.АдресEmail КАК АдресEmail
	               |ИЗ
	               |	РегистрСведений.ксПолучатели КАК ксПолучатели
	               |ГДЕ
	               |	ксПолучатели.ВидСобытия = &Событие";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АдресEmail");
	
КонецФункции
